OpenFOAMcases/2DWMH/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          816;
        startFace       527736;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          176256;
        startFace       528552;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          176256;
        startFace       351480;
    }
    inlet
    {
        type            patch;
        nFaces          216;
        startFace       704808;
    }
    outlet
    {
        type            patch;
        nFaces          216;
        startFace       705024;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          816;
        startFace       705240;
    }
)

// ************************************************************************* //
