OpenFOAMcases/2DWMH/system/job.sh
#!/bin/sh
yhrun -n 16 -p bigdata simpleFoam -parallel
